{
	"technology": [
		{
			"id": 1,
			"title": "HTML5",
			"text": "HTML5 serves as the foundation for structuring and presenting content on the web, offering enhanced semantics, multimedia support, and interactive elements.",
			"link": "https://en.wikipedia.org/wiki/HTML5"
		},
		{
			"id": 2,
			"title": "CSS3",
			"text": "CSS3 plays a crucial role in styling and designing web pages, providing advanced layout options, animations, and responsive design capabilities for improved user interfaces.",
			"link": "https://en.wikipedia.org/wiki/CSS"
		},
		{
			"id": 3,
			"title": "JavaScript",
			"text": "JavaScript is essential for adding dynamic functionality to web applications, enabling DOM manipulation, event handling, and asynchronous communication with servers.",
			"link": "https://en.wikipedia.org/wiki/JavaScript"
		},
		{
			"id": 4,
			"title": "React",
			"text": "React is a JavaScript library for building fast and interactive user interfaces, using a component-based architecture and a virtual DOM for efficient rendering.",
			"link": "https://reactjs.org/"
		},
		{
			"id": 5,
			"title": "Redux",
			"text": "Redux is a predictable state container for JavaScript apps, often used with React for managing application state in a centralized and scalable way.",
			"link": "https://redux.js.org/"
		},
		{
			"id": 6,
			"title": "React Native",
			"text": "React Native is utilized for developing cross-platform mobile applications using JavaScript and React, enabling efficient code sharing and native app experiences on iOS and Android.",
			"link": "https://en.wikipedia.org/wiki/React_Native"
		},
		{
			"id": 7,
			"title": "Vue",
			"text": "Vue is a progressive JavaScript framework for building user interfaces. It features a declarative and component-based programming model that is simple to integrate and scale.",
			"link": "https://vuejs.org/"
		},
		{
			"id": 8,
			"title": "Nuxt 2 / Nuxt 3",
			"text": "Nuxt is a powerful framework built on Vue.js, used for creating modern and high-performance server-side rendered (SSR) and static websites with streamlined development workflows.",
			"link": "https://nuxt.com"
		},
		{
			"id": 9,
			"title": "Vuetify",
			"text": "Vuetify is a comprehensive UI library for Vue.js projects, offering pre-designed components, themes, and responsive design features to enhance user interfaces.",
			"link": "https://vuetifyjs.com/en"
		},
		{
			"id": 10,
			"title": "Node.js",
			"text": "Node.js is a runtime environment that allows JavaScript to be run on the server side, enabling the development of scalable and high-performance web applications.",
			"link": "https://nodejs.org/"
		},
		{
			"id": 11,
			"title": "WordPress",
			"text": "WordPress serves as a versatile platform for creating dynamic websites and blogs, providing customizable themes, plugins, and content management tools for easy publishing and management.",
			"link": "https://en.wikipedia.org/wiki/WordPress"
		},
		{
			"id": 12,
			"title": "GitHub",
			"text": "GitHub plays a pivotal role in code collaboration and version control, facilitating efficient code management, collaboration among developers, and project tracking.",
			"link": "https://en.wikipedia.org/wiki/GitHub"
		},
		{
			"id": 13,
			"title": "Vuex/Pinia",
			"text": "Vuex and Pinia are state management libraries for Vue.js, offering centralized state management, data sharing, and reactive updates to streamline application development and maintain data consistency.",
			"link": "https://www.telerik.com/blogs/vue-js-state-management-pinia-vs-vuex"
		},
		{
			"id": 14,
			"title": "AWS",
			"text": "Amazon Web Services (AWS) is a comprehensive cloud platform that provides a wide range of services including computing power, storage, databases, and machine learning. It enables scalable, secure, and cost-effective solutions for deploying and managing applications.",
			"link": "https://aws.amazon.com/"
		},
		{
			"id": 15,
			"title": "Leaflet",
			"text": "Leaflet is a lightweight, open-source JavaScript library for interactive maps, widely used for embedding customizable maps into web applications.",
			"link": "https://leafletjs.com/"
		},
		{
			"id": 16,
			"title": "Mapbox",
			"text": "Mapbox is a flexible mapping platform that enables developers to create custom maps and geolocation experiences. It offers advanced styling, real-time data visualization, and seamless integration with web and mobile applications.",
			"link": "https://www.mapbox.com/"
		}
	],
	"projects": [
		{
			"title": "xDock",
			"link": "https://xdock.io/",
			"text": "xDock is a powerful platform that simplifies distribution and logistics by connecting drivers with cross-dock facilities, warehouses, and storage points across the country.",
			"logo": "/projects/xdock.webp",
			"technology": "Nuxt 2, Vuetify, Vuex, AWS, Mapbox"
		},
		{
			"title": "Blue ridge suppliers",
			"link": "https://blueridgesuppliers.com/",
			"text": "A one-stop shop offering a wide range of high-quality building materials tailored to meet the unique needs of contractors and construction professionals.",
			"logo": "/projects/brs.webp",
			"technology": "Nuxt 3, Gsap, Pinia, AWS"
		},
		{
			"title": "Serve Freight",
			"link": "https://servefreight.com/",
			"text": "ServeFreight is a digital platform that connects shippers with top-tier carriers to ensure fast, reliable, and cost-effective transportation solutions.",
			"logo": "/projects/servefreight.webp",
			"technology": "Wordpress, Contact Form 7"
		},
		{
			"title": "Patton cap",
			"link": "https://pattoncap.com/",
			"text": "Patton Cap specializes in crafting custom homes throughout Western North Carolina, delivering quality construction and personalized service for every client.",
			"logo": "/projects/pattoncap.webp",
			"technology": "Wordpress, Contact Form 7, ACF, Custom Post Type UI"
		},
		{
			"title": "Jump Cup",
			"link": "https://jumpcup.com/",
			"text": "JumpCup transforms your daily coffee run into an adventure with bold flavors, unique drinks, and a vibrant customer experience you’ll want to repeat.",
			"logo": "/projects/jumpcup.webp",
			"technology": "Wordpress, Contact Form 7, ACF, Custom Post Type UI"
		},
		{
			"title": "Xcold",
			"link": "https://xcoldchain.com/",
			"text": "Xcold offers specialized cold chain logistics with expert temperature control and monitoring for perishable goods, ensuring freshness and safety.",
			"logo": "/projects/xcold.webp",
			"technology": "Wordpress, Contact Form 7"
		},
		{
			"title": "Zelh",
			"link": "https://zelh.com/",
			"text": "Zelh helps businesses scale by building remote teams, optimizing operations, and handling administrative tasks so clients can focus on growth.",
			"logo": "/projects/zelh.webp",
			"technology": "Wordpress, Contact Form 7, ACF"
		},
		{
			"title": "Zelh Logistics",
			"link": "https://zelhlogistics.com/",
			"text": "Zelh Logistics provides tailored staffing and outsourcing services for logistics companies, helping streamline workflows and reduce operational costs.",
			"logo": "/projects/zelhlogistics.webp",
			"technology": "Nuxt 3, Swiper"
		},
		{
			"title": "Zelh Academy",
			"link": "https://academy.zelh.com/",
			"text": "Zelh Academy offers career guidance and professional training programs designed to help individuals grow and succeed in the logistics industry.",
			"logo": "/projects/zelhacademy.webp",
			"technology": "Wordpress, Polylang, Contact Form 7, ACF"
		},
		{
			"title": "Zelh Tech",
			"link": "https://zelh.tech/",
			"text": "Zelh Tech blends strategy, technology, and design to deliver high-impact digital solutions — from MVP launch to full-scale product growth.",
			"logo": "/projects/zelhtech.webp",
			"technology": "Nuxt 3, Swiper"
		},
		{
			"title": "Logistics Zelh Tech",
			"link": "https://logistics.zelhtech.com/",
			"text": "Logistics Zelh Tech supports freight brokerage companies with scalable growth tools, tech integrations, and process automation tailored to the industry.",
			"logo": "/projects/logisticszelhtech.webp",
			"technology": "Nuxt 3"
		}
	],
	"languages": [
		{
			"label": "Ukrainian",
			"progress": {
				"percent": 100,
				"size": 60,
				"showPercent": true,
				"borderBgWidth": 2,
				"borderWidth": 2,
				"fillColor": "#48abed",
				"emptyColor": "#191923"
			}
		},
		{
			"label": "English",
			"progress": {
				"percent": 75,
				"size": 60,
				"showPercent": true,
				"borderBgWidth": 2,
				"borderWidth": 2,
				"fillColor": "#48abed",
				"emptyColor": "#191923"
			}
		},
		{
			"label": "German",
			"progress": {
				"percent": 45,
				"size": 60,
				"showPercent": true,
				"borderBgWidth": 2,
				"borderWidth": 2,
				"fillColor": "#48abed",
				"emptyColor": "#191923"
			}
		},
		{
			"label": "Italian",
			"progress": {
				"percent": 40,
				"size": 60,
				"showPercent": true,
				"borderBgWidth": 2,
				"borderWidth": 2,
				"fillColor": "#48abed",
				"emptyColor": "#191923"
			}
		}
	],
	"skills": [
		{
			"label": "Html",
			"percent": 100
		},
		{
			"label": "Css",
			"percent": 100
		},
		{
			"label": "Js",
			"percent": 100
		},
		{
			"label": "Typescript",
			"percent": 100
		},
		{
			"label": "Php",
			"percent": 50
		},
		{
			"label": "Wordpress",
			"percent": 90
		},
		{
			"label": "Nuxt",
			"percent": 100
		},
		{
			"label": "React",
			"percent": 100
		},
		{
			"label": "React Native",
			"percent": 100
		}
	]
}
