{
	"technology": [
		{
			"title": "HTML5",
			"text": "HTML5 serves as the foundation for structuring and presenting content on the web, offering enhanced semantics, multimedia support, and interactive elements.",
			"link": "https://en.wikipedia.org/wiki/HTML5"
		},
		{
			"title": "CSS3",
			"text": "CSS3 plays a crucial role in styling and designing web pages, providing advanced layout options, animations, and responsive design capabilities for improved user interfaces.",
			"link": "https://en.wikipedia.org/wiki/CSS"
		},
		{
			"title": "JavaScript",
			"text": "JavaScript is essential for adding dynamic functionality to web applications, enabling DOM manipulation, event handling, and asynchronous communication with servers.",
			"link": "https://en.wikipedia.org/wiki/JavaScript"
		},
		{
			"title": "Nuxt 3",
			"text": "Nuxt 3 is a powerful framework built on Vue.js, used for creating modern and high-performance server-side rendered (SSR) and static websites with streamlined development workflows.",
			"link": "https://nuxt.com"
		},
		{
			"title": "Vuetify 3",
			"text": "Vuetify 3 is a comprehensive UI library for Vue.js projects, offering pre-designed components, themes, and responsive design features to enhance user interfaces.",
			"link": "https://vuetifyjs.com/en"
		},
		{
			"title": "React Native",
			"text": "React Native is utilized for developing cross-platform mobile applications using JavaScript and React, enabling efficient code sharing and native app experiences on iOS and Android.",
			"link": "https://en.wikipedia.org/wiki/React_Native"
		},
		{
			"title": "WordPress",
			"text": "WordPress serves as a versatile platform for creating dynamic websites and blogs, providing customizable themes, plugins, and content management tools for easy publishing and management.",
			"link": "https://en.wikipedia.org/wiki/WordPress"
		},
		{
			"title": "GitHub",
			"text": "GitHub plays a pivotal role in code collaboration and version control, facilitating efficient code management, collaboration among developers, and project tracking.",
			"link": "https://en.wikipedia.org/wiki/GitHub"
		},
		{
			"title": "Vuex/Pinia",
			"text": "Vuex and Pinia are state management libraries for Vue.js, offering centralized state management, data sharing, and reactive updates to streamline application development and maintain data consistency.",
			"link": "https://www.telerik.com/blogs/vue-js-state-management-pinia-vs-vuex"
		}
	]
}
